Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.2.52/PIC32CM6408MC00048/include/component/dmac.h
#define DMAC_SWTRIGCTRL_SWTRIG_Pos            _U_(0)                                               /**< (DMAC_SWTRIGCTRL Position) Channel xx Software Trigger */
#define DMAC_SWTRIGCTRL_SWTRIG_Msk            (_U_(0xFFF) << DMAC_SWTRIGCTRL_SWTRIG_Pos)           /**< (DMAC_SWTRIGCTRL Mask) SWTRIG */
#define DMAC_SWTRIGCTRL_SWTRIG(value)         (DMAC_SWTRIGCTRL_SWTRIG_Msk & ((value) << DMAC_SWTRIGCTRL_SWTRIG_Pos)) 

/* -------- DMAC_PRICTRL : (DMAC Offset: 0x14) (R/W 32) Priority Control -------- */
#define DMAC_PRICTRL_RESETVALUE               _U_(0x00)                                            /**<  (DMAC_PRICTRL) Priority Control  Reset Value */

#define DMAC_PRICTRL_LVLPRI0_Pos              _U_(0)                                               /**< (DMAC_PRICTRL) Level 0 Channel Priority Number Position */
#define DMAC_PRICTRL_LVLPRI0_Msk              (_U_(0xF) << DMAC_PRICTRL_LVLPRI0_Pos)               /**< (DMAC_PRICTRL) Level 0 Channel Priority Number Mask */
#define DMAC_PRICTRL_LVLPRI0(value)           (DMAC_PRICTRL_LVLPRI0_Msk & ((value) << DMAC_PRICTRL_LVLPRI0_Pos))
#define DMAC_PRICTRL_RRLVLEN0_Pos             _U_(7)                                               /**< (DMAC_PRICTRL) Level 0 Round-Robin Scheduling Enable Position */
#define DMAC_PRICTRL_RRLVLEN0_Msk             (_U_(0x1) << DMAC_PRICTRL_RRLVLEN0_Pos)              /**< (DMAC_PRICTRL) Level 0 Round-Robin Scheduling Enable Mask */
#define DMAC_PRICTRL_RRLVLEN0(value)          (DMAC_PRICTRL_RRLVLEN0_Msk & ((value) << DMAC_PRICTRL_RRLVLEN0_Pos))
#define   DMAC_PRICTRL_RRLVLEN0_STATIC_LVL_Val _U_(0x0)                                             /**< (DMAC_PRICTRL) Static arbitration scheme for channels with level 0 priority  */
#define   DMAC_PRICTRL_RRLVLEN0_ROUND_ROBIN_LVL_Val _U_(0x1)                                             /**< (DMAC_PRICTRL) Round-robin arbitration scheme for channels with level 0 priority  */
#define DMAC_PRICTRL_RRLVLEN0_STATIC_LVL      (DMAC_PRICTRL_RRLVLEN0_STATIC_LVL_Val << DMAC_PRICTRL_RRLVLEN0_Pos) /**< (DMAC_PRICTRL) Static arbitration scheme for channels with level 0 priority Position  */
#define DMAC_PRICTRL_RRLVLEN0_ROUND_ROBIN_LVL (DMAC_PRICTRL_RRLVLEN0_ROUND_ROBIN_LVL_Val << DMAC_PRICTRL_RRLVLEN0_Pos) /**< (DMAC_PRICTRL) Round-robin arbitration scheme for channels with level 0 priority Position  */
#define DMAC_PRICTRL_LVLPRI1_Pos              _U_(8)                                               /**< (DMAC_PRICTRL) Level 1 Channel Priority Number Position */
#define DMAC_PRICTRL_LVLPRI1_Msk              (_U_(0xF) << DMAC_PRICTRL_LVLPRI1_Pos)               /**< (DMAC_PRICTRL) Level 1 Channel Priority Number Mask */
#define DMAC_PRICTRL_LVLPRI1(value)           (DMAC_PRICTRL_LVLPRI1_Msk & ((value) << DMAC_PRICTRL_LVLPRI1_Pos))
#define DMAC_PRICTRL_RRLVLEN1_Pos             _U_(15)                                              /**< (DMAC_PRICTRL) Level 1 Round-Robin Scheduling Enable Position */
#define DMAC_PRICTRL_RRLVLEN1_Msk             (_U_(0x1) << DMAC_PRICTRL_RRLVLEN1_Pos)              /**< (DMAC_PRICTRL) Level 1 Round-Robin Scheduling Enable Mask */
#define DMAC_PRICTRL_RRLVLEN1(value)          (DMAC_PRICTRL_RRLVLEN1_Msk & ((value) << DMAC_PRICTRL_RRLVLEN1_Pos))
#define   DMAC_PRICTRL_RRLVLEN1_STATIC_LVL_Val _U_(0x0)                                             /**< (DMAC_PRICTRL) Static arbitration scheme for channels with level 1 priority  */
#define   DMAC_PRICTRL_RRLVLEN1_ROUND_ROBIN_LVL_Val _U_(0x1)                                             /**< (DMAC_PRICTRL) Round-robin arbitration scheme for channels with level 1 priority  */
#define DMAC_PRICTRL_RRLVLEN1_STATIC_LVL      (DMAC_PRICTRL_RRLVLEN1_STATIC_LVL_Val << DMAC_PRICTRL_RRLVLEN1_Pos) /**< (DMAC_PRICTRL) Static arbitration scheme for channels with level 1 priority Position  */
#define DMAC_PRICTRL_RRLVLEN1_ROUND_ROBIN_LVL (DMAC_PRICTRL_RRLVLEN1_ROUND_ROBIN_LVL_Val << DMAC_PRICTRL_RRLVLEN1_Pos) /**< (DMAC_PRICTRL) Round-robin arbitration scheme for channels with level 1 priority Position  */
#define DMAC_PRICTRL_LVLPRI2_Pos              _U_(16)                                              /**< (DMAC_PRICTRL) Level 2 Channel Priority Number Position */
#define DMAC_PRICTRL_LVLPRI2_Msk              (_U_(0xF) << DMAC_PRICTRL_LVLPRI2_Pos)               /**< (DMAC_PRICTRL) Level 2 Channel Priority Number Mask */
#define DMAC_PRICTRL_LVLPRI2(value)           (DMAC_PRICTRL_LVLPRI2_Msk & ((value) << DMAC_PRICTRL_LVLPRI2_Pos))
#define DMAC_PRICTRL_RRLVLEN2_Pos             _U_(23)                                              /**< (DMAC_PRICTRL) Level 2 Round-Robin Scheduling Enable Position */
#define DMAC_PRICTRL_RRLVLEN2_Msk             (_U_(0x1) << DMAC_PRICTRL_RRLVLEN2_Pos)              /**< (DMAC_PRICTRL) Level 2 Round-Robin Scheduling Enable Mask */
#define DMAC_PRICTRL_RRLVLEN2(value)          (DMAC_PRICTRL_RRLVLEN2_Msk & ((value) << DMAC_PRICTRL_RRLVLEN2_Pos))
#define   DMAC_PRICTRL_RRLVLEN2_STATIC_LVL_Val _U_(0x0)                                             /**< (DMAC_PRICTRL) Static arbitration scheme for channels with level 2 priority  */
#define   DMAC_PRICTRL_RRLVLEN2_ROUND_ROBIN_LVL_Val _U_(0x1)                                             /**< (DMAC_PRICTRL) Round-robin arbitration scheme for channels with level 2 priority  */
#define DMAC_PRICTRL_RRLVLEN2_STATIC_LVL      (DMAC_PRICTRL_RRLVLEN2_STATIC_LVL_Val << DMAC_PRICTRL_RRLVLEN2_Pos) /**< (DMAC_PRICTRL) Static arbitration scheme for channels with level 2 priority Position  */
#define DMAC_PRICTRL_RRLVLEN2_ROUND_ROBIN_LVL (DMAC_PRICTRL_RRLVLEN2_ROUND_ROBIN_LVL_Val << DMAC_PRICTRL_RRLVLEN2_Pos) /**< (DMAC_PRICTRL) Round-robin arbitration scheme for channels with level 2 priority Position  */
#define DMAC_PRICTRL_LVLPRI3_Pos              _U_(24)                                              /**< (DMAC_PRICTRL) Level 3 Channel Priority Number Position */
#define DMAC_PRICTRL_LVLPRI3_Msk              (_U_(0xF) << DMAC_PRICTRL_LVLPRI3_Pos)               /**< (DMAC_PRICTRL) Level 3 Channel Priority Number Mask */
#define DMAC_PRICTRL_LVLPRI3(value)           (DMAC_PRICTRL_LVLPRI3_Msk & ((value) << DMAC_PRICTRL_LVLPRI3_Pos))
#define DMAC_PRICTRL_RRLVLEN3_Pos             _U_(31)                                              /**< (DMAC_PRICTRL) Level 3 Round-Robin Scheduling Enable Position */
#define DMAC_PRICTRL_RRLVLEN3_Msk             (_U_(0x1) << DMAC_PRICTRL_RRLVLEN3_Pos)              /**< (DMAC_PRICTRL) Level 3 Round-Robin Scheduling Enable Mask */
#define DMAC_PRICTRL_RRLVLEN3(value)          (DMAC_PRICTRL_RRLVLEN3_Msk & ((value) << DMAC_PRICTRL_RRLVLEN3_Pos))
#define   DMAC_PRICTRL_RRLVLEN3_STATIC_LVL_Val _U_(0x0)                                             /**< (DMAC_PRICTRL) Static arbitration scheme for channels with level 3 priority  */
#define   DMAC_PRICTRL_RRLVLEN3_ROUND_ROBIN_LVL_Val _U_(0x1)                                             /**< (DMAC_PRICTRL) Round-robin arbitration scheme for channels with level 3 priority  */
#define DMAC_PRICTRL_RRLVLEN3_STATIC_LVL      (DMAC_PRICTRL_RRLVLEN3_STATIC_LVL_Val << DMAC_PRICTRL_RRLVLEN3_Pos) /**< (DMAC_PRICTRL) Static arbitration scheme for channels with level 3 priority Position  */
#define DMAC_PRICTRL_RRLVLEN3_ROUND_ROBIN_LVL (DMAC_PRICTRL_RRLVLEN3_ROUND_ROBIN_LVL_Val << DMAC_PRICTRL_RRLVLEN3_Pos) /**< (DMAC_PRICTRL) Round-robin arbitration scheme for channels with level 3 priority Position  */
#define DMAC_PRICTRL_Msk                      _U_(0x8F8F8F8F)                                      /**< (DMAC_PRICTRL) Register Mask  */


